---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemTopExtensionDis
source: html/824d2b1d-e2bd-99eb-e896-8fdc5f327f3a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemTopExtensionDis Property

"Top Extension Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemTopExtensionDis { get; }
```